jwt_auth_rails_backend/app/controllers/api/v1/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Ben"], ["LIMIT", 1]]
---
  def create # POST /api/v1/login
    @user = User.find_by(username: user_login_params[:username])